In [319]:
import pandas as pd
import numpy as np
df = pd.read_csv("C:/Users/PC/CODE/PYTHON/Data-Science-Practice/Titanic_ML_Model_Prediction/titanic/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [320]:
# 
df_n = df.drop(columns=["Name","SibSp","Parch","Ticket","Cabin","Embarked"])
df_n.head()

   PassengerId  Survived  Pclass     Sex   Age     Fare
0            1         0       3    male  22.0   7.2500
1            2         1       1  female  38.0  71.2833
2            3         1       3  female  26.0   7.9250
3            4         1       1  female  35.0  53.1000
4            5         0       3    male  35.0   8.0500

In [321]:
# Dummies
dummies = pd.get_dummies(df.Sex)
merged = pd.concat([df_n, dummies], axis= "columns")
merged.head()

   PassengerId  Survived  Pclass     Sex   Age     Fare  female  male
0            1         0       3    male  22.0   7.2500       0     1
1            2         1       1  female  38.0  71.2833       1     0
2            3         1       3  female  26.0   7.9250       1     0
3            4         1       1  female  35.0  53.1000       1     0
4            5         0       3    male  35.0   8.0500       0     1

In [322]:
# Fill missing values
final = merged.drop(columns=["Sex", "female"])
for col in final.columns:
    missing_data = final[col].isna().sum() # đếm missing data
    missing_percent = missing_data / len(final)*100 # tính phần trăm
    print(f"Column {col}: has {missing_percent}% missing data")

Column PassengerId: has 0.0% missing data
Column Survived: has 0.0% missing data
Column Pclass: has 0.0% missing data
Column Age: has 19.865319865319865% missing data
Column Fare: has 0.0% missing data
Column male: has 0.0% missing data

In [323]:
final.fillna(final.mean(numeric_only=True).round(1), inplace=True)
final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Age          891 non-null    float64
 4   Fare         891 non-null    float64
 5   male         891 non-null    uint8
dtypes: float64(2), int64(3), uint8(1)
memory usage: 35.8 KB

In [324]:
final.head()

   PassengerId  Survived  Pclass   Age     Fare  male
0            1         0       3  22.0   7.2500     1
1            2         1       1  38.0  71.2833     0
2            3         1       3  26.0   7.9250     0
3            4         1       1  35.0  53.1000     0
4            5         0       3  35.0   8.0500     1

In [443]:
# split data
data = final.drop(columns="Survived")
target = final.Survived

In [444]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(data, target, test_size= 0.2)

In [445]:
from sklearn.tree import DecisionTreeClassifier

In [446]:
model = DecisionTreeClassifier()

In [447]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [448]:
model.score(X_test, y_test)

0.8212290502793296

In [449]:
len(X_train)

712

In [450]:
test = pd.read_csv("C:/Users/PC/CODE/PYTHON/Data-Science-Practice/Titanic_ML_Model_Prediction/titanic/test.csv")
test_n = test.drop(columns=[ "Name","SibSp","Parch","Ticket","Cabin","Embarked"])
test_n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    object
 3   Age          332 non-null    float64
 4   Fare         417 non-null    float64
dtypes: float64(2), int64(2), object(1)
memory usage: 16.5+ KB

In [451]:
t_dummies = pd.get_dummies(test_n.Sex)
t_merged = pd.concat([test_n, t_dummies], axis= "columns")
t_final = t_merged.drop(columns=["Sex", "female"])
t_final.fillna(t_final.mean(numeric_only=True).round(1), inplace=True)
t_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Age          418 non-null    float64
 3   Fare         418 non-null    float64
 4   male         418 non-null    uint8
dtypes: float64(2), int64(2), uint8(1)
memory usage: 13.6 KB

In [452]:
t_final.head()

   PassengerId  Pclass   Age     Fare  male
0          892       3  34.5   7.8292     1
1          893       3  47.0   7.0000     0
2          894       2  62.0   9.6875     1
3          895       3  27.0   8.6625     1
4          896       3  22.0  12.2875     0

In [453]:
test_predict = model.predict(t_final)

In [454]:
final_df = pd.DataFrame(t_final["PassengerId"].astype(np.int64))
final_df["Survived"] = test_predict
final_df.to_csv("C:/Users/PC/CODE/PYTHON/Data-Science-Practice/Titanic_ML_Model_Prediction/titanic/prediction.csv", index = False)

In [455]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB